---
type: IFCConnectedWallData
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 4
tags: [revit-api, class]
---

# IFCConnectedWallData

`Autodesk.Revit.DB.IFC.IFCConnectedWallData` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ElementId | 2012 | `public ElementId ElementId { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Location | 2012 | `public IFCConnectedWallDataLocation Location { get ; }` |